# VS Code>New Texit File>名前を入力>なんかコード打つ

# Terminal内で文字を表示させるためには Print(”任意の文字列”)が必要
# ()内を計算式にすると計算結果を出力
# 文字列を表示させるためには""で囲う

# 文字列の足し算
# あいう + えお　⇛ あいうえお

# 計算式の項をそれぞれ""で囲うと文字列の足し算になる
# 項の片方を""で囲むとエラーが出る
# ctrl + s でセーブを忘れずに

print("Python Programming!")
print(123 + 456)
print("123 + 456")
print("123" + "456")
print("123456")
# print("123" - 456)

# str()関数
print("いちたすいちは" + str(1 + 1) + "じゃないよバーカ")
# 計算結果や変数に置き換えた数字を文字列として表示したい場合に使う

# int()関数
text = "345"
print(9 + int(text))
# 文字列だった数字を数値として扱う

# float()
print(float(text))
# 数字をfloat型にしたい時に使う
