# 関数

print(abs(-123))
# absは()内の値の絶対値を求める
# 関数の()内は”引数”と呼ぶ
# 出力の結果は”戻り値”と呼ぶ
# 二重括弧を使いたくない時は変数に()内の関数を格納する

# print(abs('あいうえお'))
# absの引数は数値しか受け付けない
# 関数によって()内に入れられる型は決まっている

print(abs(3 - 12))
# absは式の答えの絶対値を求める

print(abs(-20.3))
# float型も受けるつける

print(abs(100 - 200) / 2)
# 関数は演算子の項にできる
# 戻り値が数値の場合のみ

# 関数と変数
number = abs(100 - 200) / 2
print(number)
# 引数がごちゃついてきたら引数を変数に置き換えられる

# 関数

# round()関数
round1 = round(2.23620679 , 2)
print(round1)

round2 = round(2.231 , 2)
print(round2)
# round(数値 , 有効桁数)
# float型の数値を有効桁数を指定して四捨五入する

# min()関数
min1 = min(36 , 8 , 96 , 383)
print(min1)
# 引数の中で最小値を出力する

# max()関数
max1 = max(36 , 8 , 96 , 383)
print(max1)
# 引数の中で最大値を出力する